In [6]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')

In [7]:
arr1 = np.array([[2,3],[6,-7]])
eigenvalues, eigenvectors = np.linalg.eig(arr1)
eigenvalues

array([ 3.68465844, -8.68465844])

In [8]:
eigenvectors

array([[ 0.87192821, -0.27032301],
       [ 0.48963374,  0.96276969]])

In [9]:
data = {
    'name':['sudheer','mani','riya','laxmi','karthik'],
    'age':[20,23,24,20,30],
    'gender':['male','male','female','female','male']
}
df = pd.DataFrame(data)
df

      name  age  gender
0  sudheer   20    male
1     mani   23    male
2     riya   24  female
3    laxmi   20  female
4  karthik   30    male

In [10]:
gender_mapping = {'male':1,'female':0}
df['gender_map']=df['gender'].map(gender_mapping)
df

      name  age  gender  gender_map
0  sudheer   20    male           1
1     mani   23    male           1
2     riya   24  female           0
3    laxmi   20  female           0
4  karthik   30    male           1

In [11]:
df['age_replace'] = df['age'].replace({20:21})
df

      name  age  gender  gender_map  age_replace
0  sudheer   20    male           1           21
1     mani   23    male           1           23
2     riya   24  female           0           24
3    laxmi   20  female           0           21
4  karthik   30    male           1           30

In [16]:
import sqlite3
conn = sqlite3.connect('databaseserver.db')
cur = conn.cursor()
cur.execute('''
         create table if not exists stu_data7(stu_name varchar2(30),stu_age number(10),stu_address varchar2(20),phno number(10))
    '''
   )
data = [
    (121,'sudheer',20,'bvrm'),
    (122,'mani',19,'pkl')
]
cur.executemany("insert into stu_data7(stu_name,stu_age,stu_address,phno) values (?,?,?,?)",data)
cur.execute("DELETE FROM stu_data7 WHERE stu_name = ?", ('sudheer',))
rows_deleted = cur.rowcount  # Get the number of rows affected by the DELETE operation
print(f"Rows deleted: {rows_deleted}")
conn.commit()

Rows deleted: 0

In [15]:
cur.execute("SELECT * FROM stu_data7")
rows = cur.fetchall()
columns = [desc[0] for desc in cur.description] 
df = pd.DataFrame(rows, columns=columns)


df.head()

  stu_name  stu_age stu_address  phno
0      121  sudheer          20  bvrm
1      122     mani          19   pkl
2      121  sudheer          20  bvrm
3      122     mani          19   pkl
4      121  sudheer          20  bvrm

In [17]:
import sqlite3

conn = sqlite3.connect('databaseserver.db')
cur = conn.cursor()

# Assuming the table 'stu_data7' already exists

# Display rows where stu_name is 'sudheer' before deletion
cur.execute("SELECT * FROM stu_data7 WHERE stu_name = ?", ('sudheer',))
rows_before_deletion = cur.fetchall()
print(f"Rows before deletion where stu_name is 'sudheer': {rows_before_deletion}")

# Deleting rows where stu_name is 'sudheer'
cur.execute("DELETE FROM stu_data7 WHERE stu_name = ?", ('sudheer',))
rows_deleted = cur.rowcount  # Get the number of rows affected by the DELETE operation
print(f"Rows deleted: {rows_deleted}")

conn.commit()

Rows before deletion where stu_name is 'sudheer': []
Rows deleted: 0

In [18]:
cur.execute("SELECT * FROM stu_data7")
all_rows = cur.fetchall()
print(all_rows)

[('121', 'sudheer', '20', 'bvrm'), ('122', 'mani', '19', 'pkl'), ('121', 'sudheer', '20', 'bvrm'), ('122', 'mani', '19', 'pkl'), ('121', 'sudheer', '20', 'bvrm'), ('122', 'mani', '19', 'pkl'), ('121', 'sudheer', '20', 'bvrm'), ('122', 'mani', '19', 'pkl')]

In [19]:
import pandas as pd
import numpy as np
import datetime

# Creating a sample time series data
np.random.seed(0)
date_range = pd.date_range('2023-01-01', '2023-12-31', freq='D')
time_series = pd.Series(np.random.randint(0, 100, size=len(date_range)), index=date_range)

# Resampling to a monthly frequency (Upsampling)
monthly_data = time_series.resample('M').mean()

# Downsampling to a weekly frequency
weekly_data = time_series.resample('W').mean()

# Upsampling to a higher frequency using forward fill (ffill)
upsampled_data = time_series.resample('H').ffill()

# Printing a sample of each resampled time series
print("Monthly Upsampled Data:")
print(monthly_data.head())

print("\nWeekly Downsampled Data:")
print(weekly_data.head())

print("\nUpsampled Data using forward fill (Hourly):")
print(upsampled_data.head())

Monthly Upsampled Data:
2023-01-31    56.838710
2023-02-28    40.928571
2023-03-31    45.064516
2023-04-30    53.633333
2023-05-31    46.870968
Freq: M, dtype: float64

Weekly Downsampled Data:
2023-01-01    44.000000
2023-01-08    51.142857
2023-01-15    62.714286
2023-01-22    63.285714
2023-01-29    50.285714
Freq: W-SUN, dtype: float64

Upsampled Data using forward fill (Hourly):
2023-01-01 00:00:00    44
2023-01-01 01:00:00    44
2023-01-01 02:00:00    44
2023-01-01 03:00:00    44
2023-01-01 04:00:00    44
Freq: H, dtype: int32